% Moodleの「エピポーラ幾何」のページから
% xx1とxx2の配列データを以下にコピーペーストせよ

xx1 = [0.038706, 0.39742; 0.218109, 0.205624; 0.219851, -0.174777; -0.187688, -0.15966; -0.160864, 0.239314; 0.038706, 0.39742; -0.009555, 0.24479; 0.121499, 0.103355; 0.117776, -0.175213; -0.174528, -0.164537; -0.155822, 0.123875; -0.009555, 0.24479; 0.121499, 0.103355; 0.218109, 0.205624; 0.219851, -0.174777; 0.117776, -0.175213; -0.174528, -0.164537; -0.187688, -0.15966; -0.160864, 0.239314; -0.155822, 0.123875];

xx2 = [-0.061407, 0.82467; -0.248179, 0.489724; -0.173567, -4.04e-4; 0.38851, 0.130168; 0.257525, 0.702517; -0.061407, 0.82467; 0.076442, 0.529215; -0.054898, 0.311132; 0.003428, -0.022865; 0.375802, 0.055597; 0.292469, 0.42601; 0.076442, 0.529215; -0.054898, 0.311132; -0.248179, 0.489724; -0.173567, -4.04e-4; 0.003428, -0.022865; 0.375802, 0.055597; 0.38851, 0.130168; 0.257525, 0.702517; 0.292469, 0.42601];

% 画像の表示
subplot(2,2,1); plot(xx1(:,1),xx1(:,2),'r'); hold on;  
plot(xx1(:,1),xx1(:,2),'ro'); hold off; axis([-1,1,-1,1]);
subplot(2,2,2); plot(xx2(:,1),xx2(:,2),'g'); hold on;  
plot(xx2(:,1),xx2(:,2),'go'); hold off; axis([-1,1,-1,1]);

% 以下に各自のプログラムを作成せよ

%calculation F matrix
M = zeros(20,9);
for i = 1:20
    x1 = xx1(i,1);
    y1 = xx1(i,2);
    x2 = xx2(i,1);
    y2 = xx2(i,2);
    M(i,:) = [x1*x2, y1*x2, x2, x1*y2, y1*y2, y2, x1, y1, 1];
end;
[v,d] = eig(M'*M);
f = v(:,1);
F = [f(1:3)';f(4:6)';f(7:9)'];

%calculation R,T
[R1,R2,T1,T2] = compRT(F);

%calculation e
[v1,d1] = eig(F'*F);
e1h = v1(:,1);
e1 = [e1h(1),e1h(2)]/e1h(3);
[v2,d2] = eig(F*F');
e2h = v2(:,1);
e2 = [e2h(1),e2h(2)]/e2h(3);

%calculation l
l1h = zeros(3,20);
l2h = zeros(3,20);
for i = 1:20
    l1h(:,i) = F'*[xx2(i,1);xx2(i,2);1];
    l2h(:,i) = F *[xx1(i,1);xx1(i,2);1];
end;

% 画像の表示
subplot(2,2,3); plot(xx1(:,1),xx1(:,2),'r'); hold on;  
plot(xx1(:,1),xx1(:,2),'ro'); plot(e1(1),e1(2),'ro');
for i = 1:20 
    wline(l1h(:,i));
end;
hold off; axis([-1,1,-1,1]);
subplot(2,2,4); plot(xx2(:,1),xx2(:,2),'g'); hold on;
plot(xx2(:,1),xx2(:,2),'go'); plot(e2(1),e2(2),'go');
for i = 1:20 
    wline(l2h(:,i));
end;
hold off; axis([-1,1,-1,1]);

ans_T1 = round(T1/max(T1, [], "ComparisonMethod", "abs"), 2);
ans_e1 = round(e1,2);
ans_e2 = round(e2,2);
ans_l1 = round(l1h(:,1)/max(l1h(:,1), [], "ComparisonMethod", "abs"), 2);
ans_l2 = round(l2h(:,1)/max(l2h(:,1), [], "ComparisonMethod", "abs"), 2);

disp(ans_T1);disp(ans_e1);disp(ans_e2);disp(ans_l1);disp(ans_l2);